hiperiondev/esp32idf_APRS/main/app_config.c
// @file app_config.c
//
// @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
// @date 2026
// @copyright GNU General Public License v3
// @see https://github.com/hiperiondev/esp32idf_APRS
//
// @note
// This is based on other projects:
//     VP-Digi: https://github.com/sq8vps/vp-digi
//     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
//     LibAPRS: https://github.com/markqvist/LibAPRS
//
//     please contact their authors for more information.
//
// @brief Persistent application configuration: defaults, load/save of
// /storage/config.json on LittleFS (via cJSON) and the global g_config instance
// shared by every component and web admin page.

#include <float.h>
#include <math.h>
#include <stdio.h>
#include <stdlib.h> // strtod() - shortest round-tripping precision for the JSON number writer
#include <string.h>

#include "app_config.h"
// RF_TX_BUFFERS_MIN/MAX, RF_PREAMBLE_MS_MIN/MAX, RF_TX_TIMESLOT_MS_MAX,
// PTT_MIN_UNKEY_MS_MAX, CSMA_PERSIST_MIN: the same bounds the Radiomodem form
// enforces, so what is loaded from flash and what is saved from the web admin
// can never accept different values.
#include "aprs_service.h"
#include "cJSON.h"
// MODEM_PTT_ACTIVE_HIGH: the board's PTT polarity, #ifndef-guarded in that
// header and overridden from the top-level CMakeLists.txt. Both it and
// MODEM_PTT_GPIO (the PTT pin itself) are fixed compile-time constants with
// no g_config counterpart - see aprs_service_build_modem_config().
#include "esp32idf_radioamateur_modem_config.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "json_escape.h"   // json_write_escaped()
#include "json_store.h"    // shared JSON-file store scaffolding
#include "sensors_local.h" // sensors_local_channel_name() / _from_name() - WX field mappings are stored by driver name, not registry index
#include "storage.h"       // storage_write_lock() - keeps a save from overlapping a whole-partition format
#include "time_sync.h"     // time_sync_tz_count() - bounds g_config.timezone_idx on load

static const char *TAG = "app_config";
#define CONFIG_PATH     "/storage/config.json"
#define CONFIG_TMP_PATH "/storage/config.json.tmp"

app_config_t g_config;

// Serializes every save/load of the underlying config.json file. Without
// this, two overlapping POSTs (e.g. a user clicking Save twice quickly, or a
// page auto-refresh racing a save) could both end up inside
// app_config_save() at once, doing redundant work and each rewriting the
// live config from under the other. (Note: esp_littlefs already takes a
// per-instance lock around every VFS op, so overlapping saves cannot corrupt
// the filesystem's own metadata, and the stdio buffer allocation that a save
// would otherwise make on its first write is handled separately - see
// json_store_open_tmp(). This mutex is here because serializing saves is
// correct on its own terms: it avoids wasted flash writes and it is what lets
// a save reuse a single static stdio buffer.) Created lazily so this file has
// no init-order dependency.
//
// Returns NULL when the heap had no room for the mutex: every caller tests
// the handle before using it, so an out-of-memory device reports a failed save
// instead of taking a NULL handle, which aborts the calling task.
static SemaphoreHandle_t s_config_mutex = NULL;

static SemaphoreHandle_t config_mutex(void) {
    if (!s_config_mutex) {
        static portMUX_TYPE creation_lock = portMUX_INITIALIZER_UNLOCKED;
        taskENTER_CRITICAL(&creation_lock);
        if (!s_config_mutex)
            s_config_mutex = xSemaphoreCreateMutex();
        taskEXIT_CRITICAL(&creation_lock);
    }
    return s_config_mutex;
}

// Short-held lock guarding concurrent access to the live g_config struct
// itself. Distinct from s_config_mutex above (which is held across the entire
// flash serialization in app_config_save() and would stall readers): this one
// is a strict LEAF lock, only ever held long enough to mutate/copy a few
// fields. See the app_config_lock() contract in app_config.h. Created lazily
// with the same one-time-init guard as config_mutex(), and NULL under the same
// out-of-memory condition.
static SemaphoreHandle_t s_data_mutex = NULL;

static SemaphoreHandle_t data_mutex(void) {
    if (!s_data_mutex) {
        static portMUX_TYPE creation_lock = portMUX_INITIALIZER_UNLOCKED;
        taskENTER_CRITICAL(&creation_lock);
        if (!s_data_mutex)
            s_data_mutex = xSemaphoreCreateMutex();
        taskEXIT_CRITICAL(&creation_lock);
    }
    return s_data_mutex;
}

void app_config_lock(void) {
    // A device that could not allocate the mutex runs unserialized rather than
    // aborting on a NULL handle: the same trade storage.c's writer gate makes,
    // and the only alternative on a heap too small to hold one semaphore.
    SemaphoreHandle_t m = data_mutex();
    if (m)
        xSemaphoreTake(m, portMAX_DELAY);
}

void app_config_unlock(void) {
    if (s_data_mutex)
        xSemaphoreGive(s_data_mutex);
}

static void set_str(char *dst, size_t sz, const char *val) {
    if (!val) {
        dst[0] = 0;
        return;
    }
    strncpy(dst, val, sz - 1);
    dst[sz - 1] = 0;
}

void app_config_set_defaults(app_config_t *c) {
    memset(c, 0, sizeof(*c));

    c->synctime = true;
    c->cpuFreq = 240;
    c->timezone_idx = 0; // UTC

    set_str(c->my_callsign, sizeof(c->my_callsign), "NOCALL");
    c->my_lat = 0.0f;
    c->my_lon = 0.0f;
    c->my_alt = 0.0f;

    c->my_phg_power = 1;
    c->my_phg_gain = 6.0f;
    c->my_phg_height = 10;
    c->my_phg_dir = 0;

    c->pos_ambiguity = 0;
    c->status_grid_en = false;

    c->wifi_mode = 2; // AP_STA equivalent default (matches original shipping as AP)
    c->wifi_power = 20;
    for (int i = 0; i < WIFI_STA_NUM; i++) {
        c->wifi_sta[i].enable = false;
        set_str(c->wifi_sta[i].wifi_ssid, sizeof(c->wifi_sta[i].wifi_ssid), "WIFI_AP");
        set_str(c->wifi_sta[i].wifi_pass, sizeof(c->wifi_sta[i].wifi_pass), "");
    }
    c->wifi_ap_ch = WIFI_AP_CH_DEFAULT;
    set_str(c->wifi_ap_ssid, sizeof(c->wifi_ap_ssid), "esp32idf_APRS");
    set_str(c->wifi_ap_pass, sizeof(c->wifi_ap_pass), "esp32idf_APRS");

