hiperiondev/esp32idf_APRS/main/app_config.c
    // IGATE
    c->igate_en = true;
    c->rf2inet = true;
    c->inet2rf = false;
    c->igate_loc2rf = false;
    c->igate_loc2inet = true;
    c->aprs_ssid = 10;
    set_str(c->aprs_mycall, sizeof(c->aprs_mycall), "NOCALL");
    set_str(c->aprs_passcode, sizeof(c->aprs_passcode), "-1");
    // Slot 0 keeps the original single-server default; the remaining slots
    // start disabled so an upgraded device connects exactly as before until
    // the operator opts into the extra failover servers.
    c->aprs_server[0].enable = true;
    set_str(c->aprs_server[0].host, sizeof(c->aprs_server[0].host), "aprs.dprns.com");
    c->aprs_server[0].port = APRS_PORT_DEFAULT;
    for (int i = 1; i < APRS_SERVER_NUM; i++) {
        c->aprs_server[i].enable = false;
        set_str(c->aprs_server[i].host, sizeof(c->aprs_server[i].host), "aprs.dprns.com");
        c->aprs_server[i].port = APRS_PORT_DEFAULT;
    }
    set_str(c->aprs_filter, sizeof(c->aprs_filter), "");
    c->igate_bcn = true;
    c->igate_lat = 0.000f;
    c->igate_lon = 0.000f;
    c->igate_alt = 0;
    c->igate_interval = 30;
    set_str(c->igate_symbol, sizeof(c->igate_symbol), "N&");
    c->igate_path = ACTIVATE_IGATE;
    set_str(c->igate_comment, sizeof(c->igate_comment), "esp32idf_APRS IGate");
    c->igate_sts_interval = 0;
    c->igate_compress = false;
    c->igate_phg_enable = false;
    c->igate_phg_use_station = false;
    c->igate_phg_power = 1;
    c->igate_phg_gain = 6.0f;
    c->igate_phg_height = 10;
    c->igate_phg_dir = 0;
    c->igate_ext_type = APRS_EXT_PHG;
    c->igate_range_miles = 0;
    c->igate_dfs_strength = 0;
    c->rf2inetFilter = IGATE_FILT_MESSAGE | IGATE_FILT_STATUS | IGATE_FILT_TELEMETRY | IGATE_FILT_WEATHER | IGATE_FILT_OBJECT | IGATE_FILT_ITEM |
                       IGATE_FILT_BUOY | IGATE_FILT_POSITION;
    c->inet2rfFilter = IGATE_FILT_MESSAGE;
    c->rf2inet_budlist_mode = BUDLIST_OFF;
    c->inet2rf_budlist_mode = BUDLIST_OFF;
    for (int i = 0; i < IGATE_BUDLIST_MAX; i++)
        set_str(c->budlist[i], sizeof(c->budlist[i]), "");

    // Satellite/ISS digipeater gate-call list: the same 6 calls this firmware
    // always used before this list became web-configurable. Remaining slots
    // (if IGATE_SATGATE_MAX ever grows past 6) default to empty/unused.
    {
        static const char *satGateDefaults[] = { "RS0ISS", "YBOX", "YBSAT", "PSAT", "W3ADO", "BJ1SI" };
        for (int i = 0; i < IGATE_SATGATE_MAX; i++)
            set_str(c->satgate[i], sizeof(c->satgate[i]), (i < (int)(sizeof(satGateDefaults) / sizeof(satGateDefaults[0]))) ? satGateDefaults[i] : "");
    }
    c->dup_cache_size = DUP_CACHE_SIZE_DEFAULT;
    c->dup_cache_timeout_ms = DUP_CACHE_TIMEOUT_MS_DEFAULT;

    c->rf2inet_range_en = false;
    c->rf2inet_range_km = 0.0f;
    c->rf2inet_prefix_en = false;
    set_str(c->rf2inet_prefixes, sizeof(c->rf2inet_prefixes), "");
    c->inet2rf_3rdparty_unwrap_en = false;
    c->igate_msg_gate_en = true;
    c->igate_local_window_sec = IGATE_LOCAL_WINDOW_SEC_DEFAULT;

    // DIGI
    c->digi_en = false;
    c->digi_ssid = 1;
    set_str(c->digi_mycall, sizeof(c->digi_mycall), "NOCALL");
    c->digi_path = ACTIVATE_DIGI;
    c->digi_bcn = true;
    c->digi_compress = false;
    c->digi_interval = 30;
    set_str(c->digi_symbol, sizeof(c->digi_symbol), "N&");
    set_str(c->digi_comment, sizeof(c->digi_comment), "esp32idf_APRS Digi");

    // Factory alias table: the New n-N Paradigm's two standard aliases get a
    // row each so their hop limits can differ, and a wildcard row catches the
    // rest of the WIDEn family and traps it down to two hops. Every row traces
    // (inserts this station's callsign), which is what makes each hop of a
    // repeated path identifiable. The fourth row is free for a regional
    // SSn-N alias.
    {
        static const digi_alias_t aliasDefaults[] = {
            { "WIDE1", 1, DIGI_ALIAS_TRACE },
            { "WIDE2", 2, DIGI_ALIAS_TRACE },
            { "WIDE#", 2, DIGI_ALIAS_TRACE },
            { "", 1, DIGI_ALIAS_OFF },
        };
        for (int i = 0; i < DIGI_ALIAS_MAX; i++) {
            if (i < (int)(sizeof(aliasDefaults) / sizeof(aliasDefaults[0]))) {
                c->digi_alias[i] = aliasDefaults[i];
            } else {
                set_str(c->digi_alias[i].alias, sizeof(c->digi_alias[i].alias), "");
                c->digi_alias[i].max_n = 1;
                c->digi_alias[i].mode = DIGI_ALIAS_OFF;
            }
        }
    }
    c->digi_fillin_only = false;
    c->digi_trap_n_clamp = true;
    // Routing on the destination SSID alone is pre-New-N behaviour that
    // bypasses the alias table entirely, so it stays off until an operator who
    // still has a legacy neighbour asks for it.
    c->digi_dest_ssid_en = false;

    // TRACKER
    c->trk_en = false;
    c->trk_ssid = 9;
    set_str(c->trk_mycall, sizeof(c->trk_mycall), "NOCALL");
    c->trk_path = ACTIVATE_TRACKER;
    c->trk_interval = 60;
    c->trk_compress = false;
    c->trk_mice = false;
    set_str(c->trk_symbol, sizeof(c->trk_symbol), "\\>");
    set_str(c->trk_comment, sizeof(c->trk_comment), "esp32idf_APRS Tracker");

    // WX
    c->wx_en = false;
    c->wx_ssid = 13;
    set_str(c->wx_mycall, sizeof(c->wx_mycall), "NOCALL");
    c->wx_path = ACTIVATE_WX;
    c->wx_interval = 300;
    set_str(c->wx_comment, sizeof(c->wx_comment), "ESP32APRS WX");
    // Enable the WX fields a typical station reports; the rest stay off until
    // the operator maps a sensor channel to them on the Weather page.
    //
    // wx_sensor_ch[] defaults to SENSOR_LOCAL_CH_NONE ("(none)" - see page_wx.c's
    // wx_channel_select()/wx_field_present() and weather.c's
    // weather_refresh_now(), which both treat it as "no source channel
    // picked"). Channel 0 is a REAL registry slot (the first registered
    // driver), not a placeholder, so defaulting to 0 here would wire the
    // fields below straight to whatever driver happened to enumerate first -
    // transmitting live sensor data on first boot even though the operator
    // never mapped a channel in Sensor Mapping. Enable/Averaged/Channel must
    // all be explicitly set by the operator before a field is ever sampled or
    // put on-air; only Channel needs the non-zero default to make that true,
    // since weather_refresh_now() already skips any field whose channel is
    // SENSOR_LOCAL_CH_NONE regardless of its Enable bit.
    for (int i = 0; i < WX_SENSOR_NUM; i++) {
        c->wx_sensor_enable[i] = false;
        c->wx_sensor_avg[i] = false;
        c->wx_sensor_ch[i] = SENSOR_LOCAL_CH_NONE;
    }
    c->wx_sensor_enable[WX_FIELD_WIND_DIRECTION] = true;
    c->wx_sensor_enable[WX_FIELD_WIND_SPEED] = true;
    c->wx_sensor_enable[WX_FIELD_WIND_GUST] = true;
    c->wx_sensor_enable[WX_FIELD_TEMPERATURE] = true;
    c->wx_sensor_enable[WX_FIELD_HUMIDITY] = true;
    c->wx_sensor_enable[WX_FIELD_PRESSURE] = true;

